<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for mBlock
    Note: mBlock has no https download site, and it has no code signature to verify.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.download.mBlock</string>
    <key>Input</key>
    <dict>
    	<key>NAME</key>
    	<string>mBlock</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
		</dict>
                <key>url</key>
                <string>http://www.mblock.cc/download/</string>
		<key>re_flags</key>
		<array>
			<string>IGNORECASE</string>
		</array>
		<key>re_pattern</key>
                <string>window.open\(\"(?P&lt;url&gt;http:\/\/download.makeblock.com\/mblock\/.*?\/mBlock_mac_v(?P&lt;version&gt;.*?).zip)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>filename</key>
            <string>%NAME%.zip</string>
        </dict>
	<dict>
		<key>Processor</key>
		<string>Unarchiver</string>
	        <key>purge_destination</key>
            	<true/>
	</dict>
	<dict>
	    <key>Processor</key>
	    <string>Copier</string>
	    <key>Arguments</key>
	    <dict>
	        <key>destination_path</key>
	        <string>%RECIPE_CACHE_DIR%/%NAME%-dmg/%NAME%.app</string>
	        <key>source_path</key>
	        <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%_*.app</string>
	        <key>overwrite</key>
	        <true/>
	    </dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>PathDeleter</string>
		<key>path_list</key>
		<array>
			<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
		</array>
	</dict>
	<dict>
        	<key>Processor</key>
        	<string>DmgCreator</string>
        	<key>Arguments</key>
            	<dict>
                	<key>dmg_root</key>
                	<string>%RECIPE_CACHE_DIR%/%NAME%-dmg/</string>
                	<key>dmg_path</key>
                	<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            	</dict>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
