<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for mBlock
    Note: mBlock has no https download site.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.download.mBlock</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>mBlock</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>url</key>
                <string>http://www.mblock.cc/software-1/mblock/mblock5/#Download</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https:\/\/mblockapp.*?com/mblock5/darwin/V(?P&lt;version&gt;.*?).pkg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>CodeSignatureVerifier</string>   
            <key>Arguments</key>   
            <dict>   
                <key>input_path</key>   
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Makeblock Co., Ltd. (XWN8AWFG9J)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
