<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for mBlock</string>
    <key>Identifier</key>
    <string>com.github.aysiu.download.mBlock</string>
    <key>Input</key>
    <dict>
    	<key>NAME</key>
    	<string>mBlock</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.mblock.cc/download/</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http.*?zip)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>filename</key>
            <string>%NAME%.zip</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
            <key>purge_destination</key>
            <true/>
            <key>archive_path</key>
			<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
