<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Burn. Cannot do code signature verification, because the code object is not signed at all.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.download.Burn</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Burn</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>SOURCEFORGE_FILE_PATTERN</key>
				<string>burn.*?-64bit.zip</string>
				<key>SOURCEFORGE_PROJECT_ID</key>
				<integer>169226</integer>
			</dict>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
