<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Lego Mindstorms.
    Note: I cannot find a download link for LEGO Mindstorms that uses https, so the http source is in here. If you find a valid
    https download link, please let me know or make a pull request.
    </string>
    <key>Identifier</key>
    <string>com.github.aysiu.download.legomindstorms</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>https://go.api.education.lego.com/v1/lms-ev3_en-us_osx</string>
            	<key>filename</key>
            	<string>LMS-EV3_Full-setup.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>CodeSignatureVerifier</string>   
            <key>Arguments</key>   
            <dict>   
               <key>input_path</key>   
               <string>%pathname%/LEGO*.*pkg</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: National Instruments (SKTKK2QZ74)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
    </array>
</dict>
</plist>
