<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports Scratch 2 into Munki.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.munki.Scratch2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Scratch 2</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Scratch is a free programming language and online community where you can create your own interactive stories, games, and animations.</string>
            <key>category</key>
            <string>Programming</string>
            <key>developer</key>
            <string>MIT</string>
            <key>display_name</key>
            <string>Scratch 2</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>installer_type</key>
            <string>copy_from_dmg</string>
            <key>items_to_copy</key>
            <array>
               <dict>
                  <key>source_item</key>
                  <string>Install Scratch 2.app/Contents/Resources/Scratch 2</string>
                  <key>destination_path</key>
                  <string>/Applications/Scratch 2.app</string>
               </dict>
            </array>
         </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.aysiu.download.Scratch2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
