<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Android File Transfer disk image. Note: Code signature verification cannot be added into this recipe
    because the Android File Transfer.app still uses a version 1 signature.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.download.androidfiletransfer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AndroidFileTransfer</string>
        <key>DOWNLOAD_URL</key>
        <string>https://dl.google.com/dl/androidjumper/mtp/current/androidfiletransfer.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Android File Transfer.app</string>
				<key>requirement</key>
				<string>identifier "com.google.android.mtpviewer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
