<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Android File Transfer disk image. Note: Code signature verification cannot be added into this recipe
    because the Android File Transfer.app still uses a version 1 signature.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.download.androidfiletransfer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AndroidFileTransfer</string>
        <key>DOWNLOAD_URL</key>
        <string>https://dl.google.com/dl/androidjumper/mtp/current/androidfiletransfer.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
