<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports Respondus LockDown Browser into Munki.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.munki.LockDownBrowser</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LockDownBrowser</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Respondus LockDown Browser</string>
            <key>category</key>
            <string>Education</string>
            <key>developer</key>
            <string>Respondus</string>
            <key>display_name</key>
            <string>LockDown Browser</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.aysiu.download.LockDownBrowser</string>
    <key>Process</key>
    <array>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>pattern</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/Install*.pkg</string>
		</dict>
		<key>Processor</key>
		<string>FileFinder</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>Comment</key>
			<string>By default, the installer .pkg is Install Respondus, etc. with the institution ID at the end. This just cleans up the name to be the name of the item and then the version number.</string>
			<key>source</key>
			<string>%found_filename%</string>
			<key>target</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%.pkg</string>
		</dict>
		<key>Processor</key>
		<string>FileMover</string>
	</dict>
    <dict>
		<key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
	</dict>
	<dict>
		<key>Arguments</key>
			<dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
	</dict>
	<dict>
		<key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_unpack/lockdownbrowser.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/application_payload/Applications</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>source</key>
			<string>%RECIPE_CACHE_DIR%/application_payload/Applications/LockDown Browser (unconfigured).app</string>
			<key>target</key>
			<string>%RECIPE_CACHE_DIR%/application_payload/Applications/LockDown Browser.app</string>
		</dict>
		<key>Processor</key>
		<string>FileMover</string>
	</dict>
	<dict>
		<key>Comment</key>
		<string>LockDown Browser by default has a receipt version of 1 every single time. And the .app bundle version doesn't take into account minor versions, so it's always 2.0.0, even if it's gone up from 2.0.0.06 to 2.0.0.08, so we're going to make an installs array out of the executable.</string>
		<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/application_payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/LockDown Browser.app/Contents/MacOS/LockDown Browser</string>
				</array>
            </dict>
		<key>Processor</key>
		<string>MunkiInstallsItemsCreator</string>
	</dict>
	<dict>
		<key>Processor</key>
		<string>MunkiPkginfoMerger</string>
	</dict>
	<dict>
		<key>Comment</key>
		<string>Get rid of the receipts array</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
					<key>receipts</key>
					</array>
                </dict>
            </dict>
        </dict>
		<dict>
    		<key>Arguments</key>
        		<dict>
        			<key>pkg_path</key>
            		<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%.pkg</string>
            		<key>repo_subdirectory</key>
            		<string>%MUNKI_REPO_SUBDIR%</string>
        		</dict>
        	<key>Processor</key>
        	<string>MunkiImporter</string>
    	</dict>
    </array>
</dict>
</plist>
