<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Jin and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.aysiu.munki.Jin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Jin</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Games</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Jin is an open source, cross platform, graphical client for chess servers, written in Java. Jin can run	either as a standalone application (available at this website) or as an applet, directly from your browser (available at the chess server's website).</string>
			<key>developer</key>
			<string>Alexander Maryanovsky</string>
			<key>display_name</key>
			<string>Jin Chess Client</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>OracleJava8</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.sheagcraig.download.Jin</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>munkiimport_appname</key>
				<string>Jin.app</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
