<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of MuseScore and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.aysiu.munki.MuseScore</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MuseScore</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Multimedia</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>MuseScore is a scorewriter for Windows, OS X, and Linux. Created by Werner Schweer, it is released as free and open source software under the GNU General Public License. It has a feature set comparable to Finale and Sibelius, supporting a wide variety of file formats and input methods.</string>
			<key>developer</key>
			<string>Werner Schweer, Nicolas Froment, Thomas Bonte, and others.</string>
			<key>display_name</key>
			<string>MuseScore</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.MuseScore</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
            	<key>dmg_path</key>
            	<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
            	<key>additional_pkginfo</key>
            	<dict>
            		<key>version</key>
            		<string>%version%</string>
            	</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
