<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Burn and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.munki.Burn</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Burn</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>There are a lot of ways to approach burning discs. Burn keeps it simple, but still offers a lot of advanced options.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Utilities</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>Maarten Foukhar</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.aysiu.download.Burn</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.localized/%NAME%.app</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
