<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Burn. Cannot do code signature verification, because the code object is not signed at all.</string>
    <key>Identifier</key>
    <string>com.github.aysiu.download.Burn</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Burn</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>SOURCEFORGE_FILE_PATTERN</key>
                <string>burn-[0-9\.]*\.zip</string>
                <key>SOURCEFORGE_PROJECT_ID</key>
                <integer>169226</integer>
            </dict>
            <key>Processor</key>
            <string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.localized/Burn.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.kiwifruitware.Burn" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5M4D5N9TXW")</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
