<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Malwarebytes and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.aysiu.munki.MalwarebytesAntiMalware</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Malwarebytes</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Security</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Formerly known as Adware Medic, MalwareBytes will scan for and remove popular adware on Macs.</string>
			<key>developer</key>
			<string>Malwarebytes</string>
			<key>display_name</key>
			<string>Malwarebytes Anti-Malware</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

declare -r mbam_helper="/Applications/Malwarebytes Anti-Malware.app/Contents/Library/LaunchServices/com.malwarebytes.HelperTool"
declare -r privtools=/Library/PrivilegedHelperTools
declare -r launchd_plist=/Library/LaunchDaemons/com.malwarebytes.HelperTool.plist

# install helper tool
if [ ! -d ${privtools} ]; then
	/bin/mkdir -p "${privtools}"
	/bin/chmod 1755 "${privtools}"
fi
/usr/bin/install -m 0544 -o root -g wheel "${mbam_helper}" ${privtools}

# generate and load the LaunchDaemon if it doesn't already exist
if [ ! -e "${launchd_plist}" ]; then
	declare -r pb=/usr/libexec/PlistBuddy
	${pb} -c 'Add :Label string com.malwarebytes.HelperTool' "${launchd_plist}"
	${pb} -c 'Add :MachServices dict' "${launchd_plist}"
	${pb} -c 'Add :MachServices:com.malwarebytes.HelperTool bool true' "${launchd_plist}"
	${pb} -c 'Add :Program string '${privtools}'/com.malwarebytes.HelperTool' "${launchd_plist}"
	${pb} -c 'Add :ProgramArguments array' "${launchd_plist}"
	${pb} -c 'Add :ProgramArguments:0 string '${privtools}'/com.malwarebytes.HelperTool' "${launchd_plist}"
	/bin/chmod 644 "${launchd_plist}"
	/usr/sbin/chown root:wheel "${launchd_plist}"
	/bin/launchctl load "${launchd_plist}"
fi
</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh

/bin/launchctl unload /Library/LaunchDaemons/com.malwarebytes.HelperTool.plist
/bin/rm -f /Library/LaunchDaemons/com.malwarebytes.HelperTool.plist

/bin/rm -f /Library/PrivilegedHelperTools/com.malwarebytes.HelperTool
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.MalwarebytesAntiMalware</string>
	<key>Process</key>
	<array>
	<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
